In [92]:
import numpy as np

In [93]:
import pandas as pd
from pandas import DataFrame

df: DataFrame = pd.read_csv('data_science_job - data_science_job.csv')
df_raw = df.copy()

In [94]:
df.shape

(19158, 13)

In [95]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0

In [96]:
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [97]:
df.tail()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [98]:
df.describe()

,enrollee_id,city_development_index,experience,training_hours,target
count,19158.000000,18679.000000,19093.000000,18392.000000,19158.000000
mean,16875.358179,0.828951,9.928036,65.185787,0.249348
std,9616.292592,0.123334,6.505268,59.885626,0.432647
min,1.000000,0.448000,0.000000,1.000000,0.000000
25%,8554.250000,0.740000,4.000000,23.000000,0.000000
50%,16982.500000,0.903000,9.000000,47.000000,0.000000
75%,25169.750000,0.920000,16.000000,88.000000,0.000000
max,33380.000000,0.949000,20.000000,336.000000,1.000000

In [99]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  18679 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  float64
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  training_hours          18392 non-null  float64
 12  target                  19158 non-null  int64
dtypes: float64(3), int64(2), object(8)
memory usage: 1.9+ MB

In [100]:
df.isnull()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,False,False,False,False,False,False,False,False,False,True,True,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False,False,False,True,True,False,False
3,False,False,False,True,False,True,False,False,False,True,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,False,False,False,False,False,False,False,False,False,True,True,False,False
19154,False,False,False,False,False,False,False,False,False,True,True,False,False
19155,False,False,False,False,False,False,False,False,False,False,False,False,False
19156,False,False,False,False,False,False,False,True,False,False,False,False,False
19157,False,False,False,True,False,False,False,True,False,True,True,False,False

In [101]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index     479
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
training_hours             766
target                       0
dtype: int64

In [102]:
df[100:200]

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
100,6172,city_11,0.550,Male,Has relevent experience,no_enrollment,Graduate,STEM,8.0,100-500,Pvt Ltd,24.0,1
101,14672,city_173,0.878,NaN,No relevent experience,no_enrollment,Masters,STEM,20.0,NaN,NaN,150.0,0
102,18257,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,11.0,500-999,NGO,20.0,0
103,24493,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,5.0,500-999,NaN,NaN,0
104,1180,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,12.0,5000-9999,Pvt Ltd,52.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,9890,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Humanities,14.0,<10,Early Stage Startup,178.0,0
196,32683,city_160,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,11.0,0
197,27104,city_36,0.893,Male,Has relevent experience,no_enrollment,High School,NaN,20.0,NaN,NaN,87.0,0
198,7731,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,NaN,NaN,84.0,0
199,31943,city_71,0.884,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,100-500,Early Stage Startup,32.0,0

In [103]:
df1 = df[100:200]

In [104]:
df1

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
100,6172,city_11,0.550,Male,Has relevent experience,no_enrollment,Graduate,STEM,8.0,100-500,Pvt Ltd,24.0,1
101,14672,city_173,0.878,NaN,No relevent experience,no_enrollment,Masters,STEM,20.0,NaN,NaN,150.0,0
102,18257,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,11.0,500-999,NGO,20.0,0
103,24493,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,5.0,500-999,NaN,NaN,0
104,1180,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,12.0,5000-9999,Pvt Ltd,52.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,9890,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,Humanities,14.0,<10,Early Stage Startup,178.0,0
196,32683,city_160,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,11.0,0
197,27104,city_36,0.893,Male,Has relevent experience,no_enrollment,High School,NaN,20.0,NaN,NaN,87.0,0
198,7731,city_65,0.802,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,NaN,NaN,84.0,0
199,31943,city_71,0.884,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,100-500,Early Stage Startup,32.0,0

## Creating Dataset

In [105]:
country = ['India', 'France', 'Germany', 'France', 'Germany', 'India', 'Germany', 'France', 'India', 'France']

In [106]:
len(country)

10

In [107]:
age = [22, 29, 35, 26, 41, 24, 38, 31, 27, 34]

salary = [50000, 70000, 85000, 65000, 90000, 52000, 88000, 72000, 58000, 75000]

experience = [0, 5, 10, 3, 15, 1, 12, 7, 2, 8]

In [108]:
len(age)

10

In [109]:
len(salary)

10

In [110]:
list_example = pd.DataFrame({
    'Country': country,
    'Age': age,
    'Salary': salary,
    'Experience': experience
})

In [111]:
list_example

   Country  Age  Salary  Experience
0    India   22   50000           0
1   France   29   70000           5
2  Germany   35   85000          10
3   France   26   65000           3
4  Germany   41   90000          15
5    India   24   52000           1
6  Germany   38   88000          12
7   France   31   72000           7
8    India   27   58000           2
9   France   34   75000           8

In [112]:
df_raw

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [113]:
df_raw[df_raw['gender'] == 'Male']

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
6,28806,city_160,0.920,Male,Has relevent experience,no_enrollment,High School,NaN,5.0,50-99,Funded Startup,24.0,0
7,402,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,<10,Pvt Ltd,18.0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19151,11385,city_149,0.689,Male,No relevent experience,Full time course,Graduate,NaN,2.0,NaN,NaN,60.0,0
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0

In [114]:
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14.0,NaN,NaN,42.0,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14.0,NaN,NaN,52.0,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,50-99,Pvt Ltd,44.0,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,0.0,500-999,Pvt Ltd,97.0,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2.0,NaN,NaN,127.0,0

In [115]:
max(df['experience'])

20.0

In [116]:
df_drop = df.dropna(axis=0)

In [117]:
df_drop.shape

(8434, 13)

In [118]:
df.value_counts()

enrollee_id  city      city_development_index  gender  relevent_experience      enrolled_university  education_level  major_discipline  experience  company_size  company_type    training_hours  target
2            city_103  0.920                   Male    No relevent experience   no_enrollment        Phd              STEM              15.0        10000+        NGO             128.0           1         1
4            city_103  0.920                   Male    No relevent experience   no_enrollment        Masters          STEM              9.0         50-99         Public Sector   13.0            0         1
8            city_103  0.920                   Female  No relevent experience   no_enrollment        Graduate         Humanities        13.0        100-500       Funded Startup  12.0            0         1
10           city_114  0.926                   Female  Has relevent experience  no_enrollment        Graduate         STEM              15.0        <10           Funded Startup  53.0            1         1
13           city_103  0.920                   Male    Has relevent experience  Part time course     Graduate         STEM              20.0        1000-4999     Pvt Ltd         78.0            0         1
                                                                                                                                                                                                           ..
33375        city_103  0.920                   Male    Has relevent experience  no_enrollment        Graduate         STEM              16.0        50-99         Public Sector   51.0            0         1
33376        city_16   0.910                   Female  Has relevent experience  no_enrollment        Masters          Business Degree   8.0         1000-4999     Public Sector   74.0            0         1
33377        city_65   0.802                   Male    Has relevent experience  no_enrollment        Graduate         Other             10.0        100-500       Pvt Ltd         27.0            0         1
33379        city_103  0.920                   Male    Has relevent experience  no_enrollment        Graduate         STEM              18.0        <10           Pvt Ltd         81.0            0         1
33380        city_83   0.923                   Male    No relevent experience   no_enrollment        Graduate         STEM              14.0        10000+        Pvt Ltd         168.0           0         1
Name: count, Length: 8434, dtype: int64

In [119]:
df.value_counts(['gender', 'city'])

gender  city
Male    city_103    3099
        city_21     1562
        city_16     1146
        city_114     992
        city_160     609
                    ...
Other   city_80        1
        city_84        1
        city_90        1
        city_91        1
        city_99        1
Name: count, Length: 255, dtype: int64

In [120]:
list_example

   Country  Age  Salary  Experience
0    India   22   50000           0
1   France   29   70000           5
2  Germany   35   85000          10
3   France   26   65000           3
4  Germany   41   90000          15
5    India   24   52000           1
6  Germany   38   88000          12
7   France   31   72000           7
8    India   27   58000           2
9   France   34   75000           8

In [121]:
list_example.loc[3, 'Age'] = np.nan

In [122]:
list_example.loc[6, 'Salary'] = np.nan

In [123]:
list_example

   Country   Age   Salary  Experience
0    India  22.0  50000.0           0
1   France  29.0  70000.0           5
2  Germany  35.0  85000.0          10
3   France   NaN  65000.0           3
4  Germany  41.0  90000.0          15
5    India  24.0  52000.0           1
6  Germany  38.0      NaN          12
7   France  31.0  72000.0           7
8    India  27.0  58000.0           2
9   France  34.0  75000.0           8

In [124]:
list_example.loc[list_example['Age'] == 41, 'Age'] = np.nan

In [125]:
list_example

   Country   Age   Salary  Experience
0    India  22.0  50000.0           0
1   France  29.0  70000.0           5
2  Germany  35.0  85000.0          10
3   France   NaN  65000.0           3
4  Germany   NaN  90000.0          15
5    India  24.0  52000.0           1
6  Germany  38.0      NaN          12
7   France  31.0  72000.0           7
8    India  27.0  58000.0           2
9   France  34.0  75000.0           8

In [126]:
list_example.loc[4, 'Age'] = 50

In [127]:
list_example

   Country   Age   Salary  Experience
0    India  22.0  50000.0           0
1   France  29.0  70000.0           5
2  Germany  35.0  85000.0          10
3   France   NaN  65000.0           3
4  Germany  50.0  90000.0          15
5    India  24.0  52000.0           1
6  Germany  38.0      NaN          12
7   France  31.0  72000.0           7
8    India  27.0  58000.0           2
9   France  34.0  75000.0           8

In [128]:
list_example.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     10 non-null     object
 1   Age         9 non-null      float64
 2   Salary      9 non-null      float64
 3   Experience  10 non-null     int64
dtypes: float64(2), int64(1), object(1)
memory usage: 452.0+ bytes

In [129]:
purchase = ['No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'No', 'Yes', 'Yes']

In [130]:
df_purchase = pd.DataFrame(purchase, columns=['Purchase'])

In [131]:
df_purchase

  Purchase
0       No
1       No
2      Yes
3      Yes
4       No
5      Yes
6       No
7       No
8      Yes
9      Yes

In [132]:
list_example['Purchase'] = purchase

In [133]:
country_data = list_example

In [134]:
country_data.value_counts('Purchase')

Purchase
No     5
Yes    5
Name: count, dtype: int64

In [135]:
country_data.value_counts()

Country  Age   Salary   Experience  Purchase
France   29.0  70000.0  5           No          1
         31.0  72000.0  7           No          1
         34.0  75000.0  8           Yes         1
Germany  35.0  85000.0  10          Yes         1
         50.0  90000.0  15          No          1
India    22.0  50000.0  0           No          1
         24.0  52000.0  1           Yes         1
         27.0  58000.0  2           Yes         1
Name: count, dtype: int64

In [136]:
country_data[country_data['Purchase'] == 'Yes']

   Country   Age   Salary  Experience Purchase
2  Germany  35.0  85000.0          10      Yes
3   France   NaN  65000.0           3      Yes
5    India  24.0  52000.0           1      Yes
8    India  27.0  58000.0           2      Yes
9   France  34.0  75000.0           8      Yes

In [148]:
country_data

   Country   Age   Salary  Experience Purchase
0    India  22.0  50000.0           0       No
1   France  29.0  70000.0           5       No
2  Germany  35.0  85000.0          10      Yes
3   France   NaN  65000.0           3      Yes
4  Germany  50.0  90000.0          15       No
5    India  24.0  52000.0           1      Yes
6  Germany  38.0      NaN          12       No
7   France  31.0  72000.0           7       No
8    India  27.0  58000.0           2      Yes
9   France  34.0  75000.0           8      Yes

In [138]:
from sklearn.preprocessing import LabelEncoder

In [139]:
country_data.head()

   Country   Age   Salary  Experience Purchase
0    India  22.0  50000.0           0       No
1   France  29.0  70000.0           5       No
2  Germany  35.0  85000.0          10      Yes
3   France   NaN  65000.0           3      Yes
4  Germany  50.0  90000.0          15       No

In [140]:
encoder = LabelEncoder()

In [141]:
empty_df = pd.DataFrame()

In [144]:
empty_df['Country'] = encoder.fit_transform(country_data['Country'])

In [145]:
empty_df

   Country
0        2
1        0
2        1
3        0
4        1
5        2
6        1
7        0
8        2
9        0

In [146]:
empty_df['Age'] = country_data['Age']

In [149]:
empty_df['Purchase'] = encoder.fit_transform(country_data['Purchase'])

In [150]:
from sklearn.impute import SimpleImputer

In [153]:
imputer = SimpleImputer(strategy='mean')

In [158]:
df_trans = pd.DataFrame(imputer.fit_transform(empty_df), columns=empty_df.columns)

In [159]:
df_trans

   Country        Age  Purchase
0      2.0  22.000000       0.0
1      0.0  29.000000       0.0
2      1.0  35.000000       1.0
3      0.0  32.222222       1.0
4      1.0  50.000000       0.0
5      2.0  24.000000       1.0
6      1.0  38.000000       0.0
7      0.0  31.000000       0.0
8      2.0  27.000000       1.0
9      0.0  34.000000       1.0

In [156]:
df_trans_copy = pd.DataFrame(df_trans)

In [157]:
df_trans_copy

     0          1    2
0  2.0  22.000000  0.0
1  0.0  29.000000  0.0
2  1.0  35.000000  1.0
3  0.0  32.222222  1.0
4  1.0  50.000000  0.0
5  2.0  24.000000  1.0
6  1.0  38.000000  0.0
7  0.0  31.000000  0.0
8  2.0  27.000000  1.0
9  0.0  34.000000  1.0